codeIgniter4/app/Controllers/PaymentController.php

    public function index($roomId)
{
    $roomModel = new \App\Models\RoomModel();
    $bookingModel = new \App\Models\BookingModel();

    // Ambil detail kamar
    $room = $roomModel->find($roomId);

    // Ambil detail booking terkait room_id
    $booking = $bookingModel->where('room_id', $roomId)->first();
---
SELECT *
FROM `rooms`
WHERE `rooms`.`id` = '1'
SELECT *
FROM `bookings`
WHERE `room_id` = '1'
 LIMIT 1