codeIgniter4/app/Controllers/RoomController.php

SELECT *
FROM `rooms`
WHERE `rooms`.`id` = '1'
---
    public function selectRoom()
    {
        $roomId = $this->request->getPost('room_id');
        $roomModel = new \App\Models\RoomModel();
        $room = $roomModel->find($roomId);