codeIgniter4/app/Models/RoomModel.php

SELECT *
FROM `rooms`
WHERE `availability` = 1
---
    public function findAvailableRooms($checkInDate, $checkOutDate)
    {
        return $this->where('availability', 1)
                    ->findAll(); // Bisa disesuaikan dengan kondisi tertentu jika perlu